База_Back/src/Catalogs/ПодключенияКОчереди/ПодключенияКОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключенияКОчереди</name>
  <owners>Catalog.НастройкиПодключенияRMQ</owners>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

База_Back/src/InformationRegisters/СообщенияКОтправке/СообщенияКОтправке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияКОтправке</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОтправикВRMQ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаПодключения</name>
    <type>
      <types>CatalogRef.НастройкиПодключенияRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаОтправки</name>
    <type>
      <types>CatalogRef.НастройкиОтправки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

База_Back/src/Enums/СостояниеОтправикВRMQ/СостояниеОтправикВRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОтправикВRMQ</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтправки</name>
  </enumValues>
</mdclass:Enum>

База_Back/src/Catalogs/ПодключенияКОчереди/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОчередьСообщений(Команда)
	
	НеОтправлено = ПредопределенноеЗначение("Перечисление.СостояниеОтправикВRMQ.НеОтправлено");
	
	Отбор = Новый Структура("КлючМаршрутизации, Состояние", Объект.КлючМаршрутизации, НеОтправлено);
	ПараметрыФормы = Новый Структура("Отбор", Отбор); 
	
	ОткрытьФорму("РегистрСведений.СообщенияКОтправке.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры
